package FarhaanRevision;

public class Duplicate_element_array {
	public static void main(String [] args) {
		
		int [] arr= { 1,2,3,4,2,3,4,5};
		System.out.println(" Duplicate elements spotted");
		
		
		
		// searches for duplicate array
		
		for( int i = 0; i <arr.length; i++)
		for( int j = i+ 1 ; j< arr.length; j++) {
			if( arr[i] == arr[j])
				System.out.println(arr[j]);
			
		}
	}

}
////या कोडमध्ये, आपल्याला दिलेल्या एका एर्यात अद्वितीय मूल्ये शोधतात आणि त्यांच्या दुरुस्तीत मूल्ये प्रिंट करतात.

//arr नावाच्या एका एर्यात पहिले प्रारंभिक मूल्ये संग्रहित केली आहेत.
//"Duplicate elements spotted" ह्या संदेशाचा प्रिंट केला जातो.
//प्रथम for लूपच्या माध्यमातून प्रत्येक मूल्यासाठी शोध केली जाते.
//दुसरे for लूप पहिल्या for लूपमध्ये संदर्भित i च्या प्रत्येक मूल्यानंतर संदर्भित होतो. त्यामध्ये प्रत्येक मूल्यासाठी, उच्चतम आवृत्तीचे मूल्य j वाढते.
//आता, प्रत्येक i आणि j कॉम्बिनेशनसाठी तुलना केली जाते. जर मूल्य समान असेल (arr[i] == arr[j]), तर त्या मूल्याची मूळातली किंमत प्रिंट केली जाते.
//शोध प्रक्रिया प्रत्येक मूल्याशी तुलना करण्याच्या नंतर संपल्याच्या नंतर कोड समाप्त होतो.
//याप्रमाणे, दिलेल्या एर्यात 2 आणि 3 अद्वितीय मूल्ये आहेत, ज्यामध्ये पुनरावृत्तीत मूल्ये आहेत. आता, प्रोग्रामचा प्रिंट करण्याचा प्रदर्शन: