package FarhaanRevision;

public class Remove_space_without_RemoveMethod {
    public static void main(String[] args) {
        String s = " hello vinit";
        for (char a : s.toCharArray()) {
            if (a != ' ') {
                System.out.print(a);
            }
        }
    }
}


*// String s मध्ये " hello vinit" ह्या स्ट्रिंगची वर्तन केली आहे.
//s.toCharArray() मेथड वापरून स्ट्रिंगला वर्णांची सरणी मिळते.
//for-each लूप वापरून ह्या सरणीमध्ये प्रत्येक वर्णासाठी प्रवेश केले जाते.
//प्रत्येक वर्णासाठी, ते खालीलप्रमाणे तपासले जातात:
//जर वर्ण रिक्त स्पेससासाठी समान नसेल (' '), तर त्या वर्णाचा मूळ मूल्य प्रिंट केला जातो.
//प्रिंट होणारे वर्ण क्रमांकानुसार प्रिंट केले जातात.
//उपरोक्त कोडमध्ये, स्पेसेस नसलेले वर्ण हे प्रिंट होतात. आपल्याला खालील प्रिंट करण्याचे प्रदर्शन मिळेल:   