package FarhaanRevision;

public class TwoD_TO_1D {
    public static void main(String[] args) {
        int a[][] = {{1, 2, 3}, {4, 5, 6}};
        int[] c = new int[a.length * a[0].length]; 
        int k = 0; 

        for (int i = 0; i < a.length; i++) { 
            for (int j = 0; j < a[i].length; j++) { 
                c[k] = a[i][j];
                System.out.print(c[k] + " "); 
                k++; 
            }
        }
    }
}
//ह्या कोडमध्ये आपल्याला दोन डिमेंशनल एरे दिलेला आहे {{1,2,3},{4,5,6}}. ज्यातील प्रत्येक एरे प्रत्येक पंक्तीमध्ये आहे. int c[] नवीन एरे आहे ज्याला 5 आकाराचे निर्माण केले गेले आहे.

//for लूपच्या माध्यमातून एकात्मिक वर्गांमध्ये प्रवेश केले जाते. a.length वर्गांचे अचूक माप दर्शवते. त्यामध्ये, प्रत्येक वर्गामध्ये लूप चालू होते a[i].length स्तंभांचे अचूक माप दर्शवते. c[i] संदर्भ आणि a[i][j] एकत्र केले जाते आणि c[i] असं निर्दिष्ट केले जाते. आपल्याला c[i] मध्ये सांगितले मान प्रिंट केले जाते.

//असे करून, दोन डिमेंशनल एरे च्या सर्व मान प्रिंट केले जाते आणि त्यांच्या सर्व संदर्भांना c नवीन एरे मध्ये ठेवले जाते.